zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70100.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2017 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2017-07-14T18:00:00Z"/>
  <variants>
    <variant ordercode="PIC32CZ1038CA70100-CB" package="TFBGA100" pinout="TFBGA100" speedmax="300000000" tempmax="+105" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
    <variant ordercode="PIC32CZ1038CA70100-AAB" package="LQFP100" pinout="LQFP100" speedmax="300000000" tempmax="+105" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M7" family="PIC32CZ" name="PIC32CZ1038CA70100" series="CA70">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW"/>
          <memory-segment name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true"/>
          <memory-segment name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW"/>
          <memory-segment name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true"/>
          <memory-segment name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512" rw="RW" exec="true"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true"/>
          <memory-segment name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true"/>
          <memory-segment name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="2" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x8" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ACC" id="6490" version="J">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x40044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
              <param name="CLOCK_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="AES" id="6149" version="W">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
            </parameters>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="S">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA8" function="B" group="AFEC0_ADTRG"/>
              <signal pad="PD30" function="X1" group="AFEC0_AD" index="0"/>
              <signal pad="PA21" function="X1" group="AFEC0_AD" index="1"/>
              <signal pad="PB3" function="X1" group="AFEC0_AD" index="2"/>
              <signal pad="PE5" function="X1" group="AFEC0_AD" index="3"/>
              <signal pad="PE4" function="X1" group="AFEC0_AD" index="4"/>
              <signal pad="PB2" function="X1" group="AFEC0_AD" index="5"/>
              <signal pad="PA17" function="X1" group="AFEC0_AD" index="6"/>
              <signal pad="PA18" function="X1" group="AFEC0_AD" index="7"/>
              <signal pad="PA19" function="X1" group="AFEC0_AD" index="8"/>
              <signal pad="PA20" function="X1" group="AFEC0_AD" index="9"/>
              <signal pad="PB0" function="X1" group="AFEC0_AD" index="10"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="35"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
            </parameters>
          </instance>
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD9" function="C" group="AFEC1_ADTRG"/>
              <signal pad="PB1" function="X1" group="AFEC1_AD" index="0"/>
              <signal pad="PC13" function="X1" group="AFEC1_AD" index="1"/>
              <signal pad="PC15" function="X1" group="AFEC1_AD" index="2"/>
              <signal pad="PC12" function="X1" group="AFEC1_AD" index="3"/>
              <signal pad="PC29" function="X1" group="AFEC1_AD" index="4"/>
              <signal pad="PC30" function="X1" group="AFEC1_AD" index="5"/>
              <signal pad="PC31" function="X1" group="AFEC1_AD" index="6"/>
              <signal pad="PC26" function="X1" group="AFEC1_AD" index="7"/>
              <signal pad="PC27" function="X1" group="AFEC1_AD" index="8"/>
              <signal pad="PC0" function="X1" group="AFEC1_AD" index="9"/>
              <signal pad="PE3" function="X1" group="AFEC1_AD" index="10"/>
              <signal pad="PE0" function="X1" group="AFEC1_AD" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZK">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
