zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70100.atdf
        <module name="USBHS" id="11292" version="G">
          <instance name="USBHS">
            <register-group address-space="base" name="USBHS" name-in-module="USBHS" offset="0x40038000"/>
            <parameters>
              <param name="INSTANCE_ID" value="34"/>
              <param name="CLOCK_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="UTMI" id="11300" version="A">
          <instance name="UTMI">
            <register-group address-space="base" name="UTMI" name-in-module="UTMI" offset="0x400E0400"/>
          </instance>
        </module>
        <module name="WDT" id="6080" version="N">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1850"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="K">
          <instance name="XDMAC">
            <register-group address-space="base" name="XDMAC" name-in-module="XDMAC" offset="0x40078000"/>
            <parameters>
              <param name="INSTANCE_ID" value="58"/>
              <param name="CLOCK_ID" value="58"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
        <module name="MPU">
          <instance name="MPU">
            <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
          </instance>
        </module>
        <module name="FPU">
          <instance name="FPU">
            <register-group address-space="base" offset="0xE000EF34" name-in-module="FPU" name="FPU"/>
          </instance>
        </module>
        <module name="OSCILLATOR">
          <instance name="OSCILLATOR">
            <signals>
              <signal pad="PB9" function="X1" group="XIN"/>
              <signal pad="PB8" function="X1" group="XOUT"/>
              <signal pad="PA7" function="X1" group="XIN32"/>
              <signal pad="PA8" function="X1" group="XOUT32"/>
            </signals>
          </instance>
        </module>
        <module name="PORT_CAPTURE">
          <instance name="PORT">
            <signals>
              <signal pad="PA3" function="X1" group="PORTDC" index="0"/>
              <signal pad="PA4" function="X1" group="PORTDC" index="1"/>
              <signal pad="PA5" function="X1" group="PORTDC" index="2"/>
              <signal pad="PA9" function="X1" group="PORTDC" index="3"/>
              <signal pad="PA10" function="X1" group="PORTDC" index="4"/>
              <signal pad="PA11" function="X1" group="PORTDC" index="5"/>
              <signal pad="PA12" function="X1" group="PORTDC" index="6"/>
              <signal pad="PA13" function="X1" group="PORTDC" index="7"/>
              <signal pad="PA14" function="X1" group="PORTDCEN" index="1"/>
              <signal pad="PA21" function="X1" group="PORTDCEN" index="2"/>
              <signal pad="PA22" function="X1" group="PORTDCCLK"/>
            </signals>
          </instance>
        </module>
        <module name="DEBUG">
          <instance name="DEBUG">
            <signals>
              <signal pad="PB4" function="X1" group="TDI"/>
              <signal pad="PB5" function="X1" group="TDO"/>
              <signal pad="PB5" function="X1" group="TRACESWO"/>
              <signal pad="PB6" function="X1" group="TMS"/>
              <signal pad="PB6" function="X1" group="SWDIO"/>
              <signal pad="PB7" function="X1" group="TCK"/>
              <signal pad="PB7" function="X1" group="SWDCLK"/>
            </signals>
          </instance>
        </module>
        <module name="FLASH_MEMORY">
          <instance name="FLASH">
            <signals>
              <signal pad="PB12" function="X1" group="ERASE"/>
            </signals>
          </instance>
        </module>
        <module name="TRACE_DEBUG_PORT">
          <instance name="TRACE">
            <signals>
              <signal pad="PD8" function="D" group="TRACECLK"/>
              <signal pad="PD4" function="C" group="TRACED" index="0"/>
              <signal pad="PD5" function="C" group="TRACED" index="1"/>
              <signal pad="PD6" function="C" group="TRACED" index="2"/>
              <signal pad="PD7" function="C" group="TRACED" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="LPM_WAKEUP">
          <instance name="WKUP">
            <signals>
              <signal pad="PA0" function="X1" group="WKUP" index="0"/>
              <signal pad="PA1" function="X1" group="WKUP" index="1"/>
              <signal pad="PA2" function="X1" group="WKUP" index="2"/>
              <signal pad="PA4" function="X1" group="WKUP" index="3"/>
              <signal pad="PA5" function="X1" group="WKUP" index="4"/>
              <signal pad="PD28" function="X1" group="WKUP" index="5"/>
              <signal pad="PA9" function="X1" group="WKUP" index="6"/>
              <signal pad="PA11" function="X1" group="WKUP" index="7"/>
              <signal pad="PA14" function="X1" group="WKUP" index="8"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PA30" function="X1" group="WKUP" index="11"/>
              <signal pad="PB3" function="X1" group="WKUP" index="12"/>
              <signal pad="PB5" function="X1" group="WKUP" index="13"/>
            </signals>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Embedded Flash Controller"/>
        <interrupt index="7" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="8" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="10" module-instance="PORTA" name="PORTA" caption="Port A"/>
        <interrupt index="11" module-instance="PORTB" name="PORTB" caption="Port B"/>
        <interrupt index="13" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="14" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="15" module-instance="USART2" name="USART2" caption="USART 2"/>
        <interrupt index="16" module-instance="PORTD" name="PORTD" caption="Port D"/>
        <interrupt index="18" module-instance="HSMCI" name="HSMCI" caption="Multimedia Card Interface"/>
        <interrupt index="19" module-instance="TWI0" name="TWI0" caption="Two Wire Interface 0"/>
        <interrupt index="20" module-instance="TWI1" name="TWI1" caption="Two Wire Interface 1"/>
        <interrupt index="21" module-instance="SPI0" name="SPI0" caption="Serial Peripheral Interface 0"/>
        <interrupt index="22" module-instance="SSC" name="SSC" caption="Synchronous Serial Controller"/>
        <interrupt index="23" module-instance="TC0" name="TC0_CH0" caption="Timer/Counter 0 Channel 0"/>
        <interrupt index="24" module-instance="TC0" name="TC0_CH1" caption="Timer/Counter 0 Channel 1"/>
        <interrupt index="25" module-instance="TC0" name="TC0_CH2" caption="Timer/Counter 0 Channel 2"/>
        <interrupt index="26" module-instance="TC1" name="TC1_CH0" caption="Timer/Counter 1 Channel 0"/>
        <interrupt index="27" module-instance="TC1" name="TC1_CH1" caption="Timer/Counter 1 Channel 1"/>
        <interrupt index="28" module-instance="TC1" name="TC1_CH2" caption="Timer/Counter 1 Channel 2"/>
        <interrupt index="29" module-instance="AFEC0" name="AFEC0" caption="Analog Front End 0"/>
        <interrupt index="31" module-instance="PWMC0" name="PWMC0" caption="Pulse Width Modulation 0"/>
        <interrupt index="32" module-instance="ICM" name="ICM" caption="Integrity Check Monitor"/>
        <interrupt index="33" module-instance="ACC" name="ACC" caption="Analog Comparator"/>
        <interrupt index="34" module-instance="USBHS" name="USBHS" caption="USB Host / Device Controller"/>
        <interrupt index="35" module-instance="MCAN0" name="MCAN0" caption="MCAN Controller 0"/>
        <interrupt index="37" module-instance="MCAN1" name="MCAN1" caption="MCAN Controller 1"/>
        <interrupt index="39" module-instance="GMAC" name="GMAC" caption="Ethernet MAC"/>
        <interrupt index="40" module-instance="AFEC1" name="AFEC1" caption="Analog Front End 1"/>
        <interrupt index="41" module-instance="TWI2" name="TWI2" caption="Two Wire Interface 2"/>
        <interrupt index="42" module-instance="SPI1" name="SPI1" caption="Serial Peripheral Interface 1"/>
        <interrupt index="43" module-instance="QSPI" name="QSPI" caption="Quad I/O Serial Peripheral Interface"/>
        <interrupt index="44" module-instance="UART2" name="UART2" caption="UART 2"/>
        <interrupt index="45" module-instance="UART3" name="UART3" caption="UART 3"/>
        <interrupt index="46" module-instance="UART4" name="UART4" caption="UART 4"/>
        <interrupt index="47" module-instance="TC2" name="TC2_CH0" caption="Timer/Counter 2 Channel 0"/>
        <interrupt index="48" module-instance="TC2" name="TC2_CH1" caption="Timer/Counter 2 Channel 1"/>
        <interrupt index="49" module-instance="TC2" name="TC2_CH2" caption="Timer/Counter 2 Channel 2"/>
        <interrupt index="50" module-instance="TC3" name="TC3_CH0" caption="Timer/Counter 3 Channel 0"/>
        <interrupt index="51" module-instance="TC3" name="TC3_CH1" caption="Timer/Counter 3 Channel 1"/>
        <interrupt index="52" module-instance="TC3" name="TC3_CH2" caption="Timer/Counter 3 Channel 2"/>
        <interrupt index="53" module-instance="MLB" name="MLB" caption="MediaLB"/>
        <interrupt index="56" module-instance="AES" name="AES" caption="AES"/>
        <interrupt index="57" module-instance="TRNG" name="TRNG" caption="True Random Generator"/>
        <interrupt index="58" module-instance="XDMAC" name="XDMAC" caption="DMA"/>
        <interrupt index="59" module-instance="ISI" name="ISI" caption="Camera Interface"/>
        <interrupt index="60" module-instance="PWMC1" name="PWMC1" caption="Pulse Width Modulation 1"/>
        <interrupt index="63" module-instance="RSWDT" name="RSWDT" caption="Reinforced Secure Watchdog Timer"/>
        <interrupt index="69" module-instance="I2SC0" name="I2SC0" caption="Inter-IC Sound controller"/>
        <interrupt index="70" module-instance="I2SC1" name="I2SC1" caption="Inter-IC Sound controller"/>
        <interrupt index="62" module-instance="SDRAMC" name="SDRAMC" caption="SDRAM Controller"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3D03F"/>
          <property name="CHIPID_CIDR" value="0xA1020C00"/>
          <property name="CHIPID_EXID" value="0x00000001"/>
        </property-group>
        <property-group name="LEGACY_INSTANCE_IDS">
          <property name="ID_TC0" value="TC0_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC1" value="TC0_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC2" value="TC0_INSTANCE_ID_CHANNEL2"/>
          <property name="ID_TC3" value="TC1_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC4" value="TC1_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC5" value="TC1_INSTANCE_ID_CHANNEL2"/>
          <property name="ID_TC6" value="TC2_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC7" value="TC2_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC8" value="TC2_INSTANCE_ID_CHANNEL2"/>
          <property name="ID_TC9" value="TC3_INSTANCE_ID_CHANNEL0"/>
          <property name="ID_TC10" value="TC3_INSTANCE_ID_CHANNEL1"/>
          <property name="ID_TC11" value="TC3_INSTANCE_ID_CHANNEL2"/>
        </property-group>
        <property-group name="ELECTRICAL_CHARACTERISTICS">
          <property name="CHIP_FREQ_SLCK_RC_MIN" value="20000"/>
          <property name="CHIP_FREQ_SLCK_RC" value="32000" caption="Typical Slow Clock Internal RC frequency"/>
          <property name="CHIP_FREQ_SLCK_RC_MAX" value="44000"/>
          <property name="CHIP_FREQ_MAINCK_RC_4MHZ" value="4000000"/>
          <property name="CHIP_FREQ_MAINCK_RC_8MHZ" value="8000000"/>
          <property name="CHIP_FREQ_MAINCK_RC_12MHZ" value="12000000"/>
          <property name="CHIP_FREQ_CPU_MAX" value="300000000"/>
          <property name="CHIP_FREQ_XTAL_32K" value="32768"/>
          <property name="CHIP_FREQ_XTAL_12M" value="12000000"/>
          <property name="CHIP_FREQ_FWS_0" value="23000000" caption="Maximum operating frequency when FWS is 0"/>
          <property name="CHIP_FREQ_FWS_1" value="46000000" caption="Maximum operating frequency when FWS is 1"/>
          <property name="CHIP_FREQ_FWS_2" value="69000000" caption="Maximum operating frequency when FWS is 2"/>
          <property name="CHIP_FREQ_FWS_3" value="92000000" caption="Maximum operating frequency when FWS is 3"/>
          <property name="CHIP_FREQ_FWS_4" value="115000000" caption="Maximum operating frequency when FWS is 4"/>
          <property name="CHIP_FREQ_FWS_5" value="138000000" caption="Maximum operating frequency when FWS is 5"/>
          <property name="CHIP_FREQ_FWS_6" value="150000000" caption="Maximum operating frequency when FWS is 6"/>
          <property name="CHIP_FREQ_FWS_NUMBER" value="7" caption="Number of FWS ranges"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM7_REV" value="0x0101" caption="CM7 Core Revision"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="Number of Bits used for Priority Levels"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="__FPU_DP" value="1" caption="Double Precision FPU"/>
        <param name="__ICACHE_PRESENT" value="1" caption="Instruction Cache present"/>
        <param name="__DCACHE_PRESENT" value="1" caption="Data Cache present"/>
        <param name="__ITCM_PRESENT" value="1" caption="Instruction TCM present"/>
        <param name="__DTCM_PRESENT" value="1" caption="Data TCM present"/>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="68"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_PIC32C" value="1"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module name="ACC" caption="Analog Comparator Controller" id="6490" version="J">
      <register-group name="ACC">
        <register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Selection for Minus Comparator Input" mask="0x00000007" name="SELMINUS" values="ACC_MR__SELMINUS"/>
          <bitfield caption="Selection For Plus Comparator Input" mask="0x00000070" name="SELPLUS" values="ACC_MR__SELPLUS"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="Edge Type" mask="0x00000600" name="EDGETYP" values="ACC_MR__EDGETYP"/>
          <bitfield caption="Invert Comparator Output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
          <bitfield caption="Selection Of Fault Source" mask="0x00002000" name="SELFS" values="ACC_MR__SELFS"/>
          <bitfield caption="Fault Enable" mask="0x00004000" name="FE" values="ACC_MR__FE"/>
        </register>
        <register caption="Interrupt Enable Register" name="ACC_IER" offset="0x24" rw="W" size="4" atomic-op="set:ACC_IMR">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Disable Register" name="ACC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:ACC_IMR">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Mask Register" name="ACC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:ACC_IMR">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Status Register" name="ACC_ISR" offset="0x30" rw="R" size="4" atomic-op="clear:ACC_ISR">
          <bitfield caption="Comparison Edge (cleared on read)" mask="0x00000001" name="CE"/>
          <bitfield caption="Synchronized Comparator Output" mask="0x00000002" name="SCO"/>
          <bitfield caption="Flag Mask" mask="0x80000000" name="MASK"/>
        </register>
        <register caption="Analog Control Register" name="ACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Current Selection" mask="0x00000001" name="ISEL" values="ACC_ACR__ISEL"/>
          <bitfield caption="Hysteresis Selection" mask="0x00000006" name="HYST"/>
        </register>
        <register caption="Write Protection Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
        </register>
      </register-group>
