zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70100.atdf
        <register caption="CC Control Register" name="MCAN_CCCR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Initialization (read/write)" mask="0x00000001" name="INIT" values="MCAN_CCCR__INIT"/>
          <bitfield caption="Configuration Change Enable (read/write, write protection)" mask="0x00000002" name="CCE" values="MCAN_CCCR__CCE"/>
          <bitfield caption="Restricted Operation Mode (read/write, write protection against '1')" mask="0x00000004" name="ASM" values="MCAN_CCCR__ASM"/>
          <bitfield caption="Clock Stop Acknowledge (read-only)" mask="0x00000008" name="CSA"/>
          <bitfield caption="Clock Stop Request (read/write)" mask="0x00000010" name="CSR" values="MCAN_CCCR__CSR"/>
          <bitfield caption="Bus Monitoring Mode (read/write, write protection against '1')" mask="0x00000020" name="MON" values="MCAN_CCCR__MON"/>
          <bitfield caption="Disable Automatic Retransmission (read/write, write protection)" mask="0x00000040" name="DAR" values="MCAN_CCCR__DAR"/>
          <bitfield caption="Test Mode Enable (read/write, write protection against '1')" mask="0x00000080" name="TEST" values="MCAN_CCCR__TEST"/>
          <bitfield caption="CAN FD Operation Enable (read/write, write protection)" mask="0x00000100" name="FDOE" values="MCAN_CCCR__FDOE"/>
          <bitfield caption="Bit Rate Switching Enable (read/write, write protection)" mask="0x00000200" name="BRSE" values="MCAN_CCCR__BRSE"/>
          <bitfield caption="Protocol Exception Event Handling (read/write, write protection)" mask="0x00001000" name="PXHD"/>
          <bitfield caption="Edge Filtering during Bus Integration (read/write, write protection)" mask="0x00002000" name="EFBI"/>
          <bitfield caption="Transmit Pause (read/write, write protection)" mask="0x00004000" name="TXP"/>
          <bitfield caption="Non-ISO Operation" mask="0x00008000" name="NISO"/>
        </register>
        <register caption="Nominal Bit Timing and Prescaler Register" name="MCAN_NBTP" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Nominal Time Segment After Sample Point" mask="0x0000007F" name="NTSEG2"/>
          <bitfield caption="Nominal Time Segment Before Sample Point" mask="0x0000FF00" name="NTSEG1"/>
          <bitfield caption="Nominal Bit Rate Prescaler" mask="0x01FF0000" name="NBRP"/>
          <bitfield caption="Nominal (Re) Synchronization Jump Width" mask="0xFE000000" name="NSJW"/>
        </register>
        <register caption="Timestamp Counter Configuration Register" name="MCAN_TSCC" offset="0x20" rw="RW" size="4">
          <bitfield caption="Timestamp Select" mask="0x00000003" name="TSS" values="MCAN_TSCC__TSS"/>
          <bitfield caption="Timestamp Counter Prescaler" mask="0x000F0000" name="TCP"/>
        </register>
        <register caption="Timestamp Counter Value Register" name="MCAN_TSCV" offset="0x24" rw="RW" size="4">
          <bitfield caption="Timestamp Counter (cleared on write)" mask="0x0000FFFF" name="TSC"/>
        </register>
        <register caption="Timeout Counter Configuration Register" name="MCAN_TOCC" offset="0x28" rw="RW" size="4">
          <bitfield caption="Enable Timeout Counter" mask="0x00000001" name="ETOC" values="MCAN_TOCC__ETOC"/>
          <bitfield caption="Timeout Select" mask="0x00000006" name="TOS" values="MCAN_TOCC__TOS"/>
          <bitfield caption="Timeout Period" mask="0xFFFF0000" name="TOP"/>
        </register>
        <register caption="Timeout Counter Value Register" name="MCAN_TOCV" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Timeout Counter (cleared on write)" mask="0x0000FFFF" name="TOC"/>
        </register>
        <register caption="Error Counter Register" name="MCAN_ECR" offset="0x40" rw="R" size="4">
          <bitfield caption="Transmit Error Counter" mask="0x000000FF" name="TEC"/>
          <bitfield caption="Receive Error Counter" mask="0x00007F00" name="REC"/>
          <bitfield caption="Receive Error Passive" mask="0x00008000" name="RP"/>
          <bitfield caption="CAN Error Logging (cleared on read)" mask="0x00FF0000" name="CEL"/>
        </register>
        <register caption="Protocol Status Register" name="MCAN_PSR" offset="0x44" rw="R" size="4">
          <bitfield caption="Last Error Code (set to 111 on read)" mask="0x00000007" name="LEC" values="MCAN_PSR__LEC"/>
          <bitfield caption="Activity" mask="0x00000018" name="ACT" values="MCAN_PSR__ACT"/>
          <bitfield caption="Error Passive" mask="0x00000020" name="EP"/>
          <bitfield caption="Warning Status" mask="0x00000040" name="EW"/>
          <bitfield caption="Bus_Off Status" mask="0x00000080" name="BO"/>
          <bitfield caption="Data Phase Last Error Code (set to 111 on read)" mask="0x00000700" name="DLEC"/>
          <bitfield caption="ESI Flag of Last Received CAN FD Message (cleared on read)" mask="0x00000800" name="RESI"/>
          <bitfield caption="BRS Flag of Last Received CAN FD Message (cleared on read)" mask="0x00001000" name="RBRS"/>
          <bitfield caption="Received a CAN FD Message (cleared on read)" mask="0x00002000" name="RFDF"/>
          <bitfield caption="Protocol Exception Event (cleared on read)" mask="0x00004000" name="PXE"/>
          <bitfield caption="Transmitter Delay Compensation Value" mask="0x007F0000" name="TDCV"/>
        </register>
        <register caption="Transmit Delay Compensation Register" name="MCAN_TDCR" offset="0x48" rw="RW" size="4">
          <bitfield caption="Transmitter Delay Compensation Filter" mask="0x0000007F" name="TDCF"/>
          <bitfield caption="Transmitter Delay Compensation Offset" mask="0x00007F00" name="TDCO"/>
        </register>
        <register caption="Interrupt Register" name="MCAN_IR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Receive FIFO 0 New Message" mask="0x00000001" name="RF0N"/>
          <bitfield caption="Receive FIFO 0 Watermark Reached" mask="0x00000002" name="RF0W"/>
          <bitfield caption="Receive FIFO 0 Full" mask="0x00000004" name="RF0F"/>
          <bitfield caption="Receive FIFO 0 Message Lost" mask="0x00000008" name="RF0L"/>
          <bitfield caption="Receive FIFO 1 New Message" mask="0x00000010" name="RF1N"/>
          <bitfield caption="Receive FIFO 1 Watermark Reached" mask="0x00000020" name="RF1W"/>
          <bitfield caption="Receive FIFO 1 Full" mask="0x00000040" name="RF1F"/>
          <bitfield caption="Receive FIFO 1 Message Lost" mask="0x00000080" name="RF1L"/>
          <bitfield caption="High Priority Message" mask="0x00000100" name="HPM"/>
          <bitfield caption="Transmission Completed" mask="0x00000200" name="TC"/>
          <bitfield caption="Transmission Cancellation Finished" mask="0x00000400" name="TCF"/>
          <bitfield caption="Tx FIFO Empty" mask="0x00000800" name="TFE"/>
          <bitfield caption="Tx Event FIFO New Entry" mask="0x00001000" name="TEFN"/>
          <bitfield caption="Tx Event FIFO Watermark Reached" mask="0x00002000" name="TEFW"/>
          <bitfield caption="Tx Event FIFO Full" mask="0x00004000" name="TEFF"/>
          <bitfield caption="Tx Event FIFO Element Lost" mask="0x00008000" name="TEFL"/>
          <bitfield caption="Timestamp Wraparound" mask="0x00010000" name="TSW"/>
          <bitfield caption="Message RAM Access Failure" mask="0x00020000" name="MRAF"/>
          <bitfield caption="Timeout Occurred" mask="0x00040000" name="TOO"/>
          <bitfield caption="Message stored to Dedicated Receive Buffer" mask="0x00080000" name="DRX"/>
          <bitfield caption="Bit Error Corrected" mask="0x00100000" name="BEC"/>
          <bitfield caption="Bit Error Uncorrected" mask="0x00200000" name="BEU"/>
          <bitfield caption="Error Logging Overflow" mask="0x00400000" name="ELO"/>
          <bitfield caption="Error Passive" mask="0x00800000" name="EP"/>
          <bitfield caption="Warning Status" mask="0x01000000" name="EW"/>
          <bitfield caption="Bus_Off Status" mask="0x02000000" name="BO"/>
          <bitfield caption="Watchdog Interrupt" mask="0x04000000" name="WDI"/>
          <bitfield caption="Protocol Error in Arbitration Phase" mask="0x08000000" name="PEA"/>
          <bitfield caption="Protocol Error in Data Phase" mask="0x10000000" name="PED"/>
          <bitfield caption="Access to Reserved Address" mask="0x20000000" name="ARA"/>
        </register>
        <register caption="Interrupt Enable Register" name="MCAN_IE" offset="0x54" rw="RW" size="4">
          <bitfield caption="Receive FIFO 0 New Message Interrupt Enable" mask="0x00000001" name="RF0NE"/>
          <bitfield caption="Receive FIFO 0 Watermark Reached Interrupt Enable" mask="0x00000002" name="RF0WE"/>
          <bitfield caption="Receive FIFO 0 Full Interrupt Enable" mask="0x00000004" name="RF0FE"/>
          <bitfield caption="Receive FIFO 0 Message Lost Interrupt Enable" mask="0x00000008" name="RF0LE"/>
          <bitfield caption="Receive FIFO 1 New Message Interrupt Enable" mask="0x00000010" name="RF1NE"/>
          <bitfield caption="Receive FIFO 1 Watermark Reached Interrupt Enable" mask="0x00000020" name="RF1WE"/>
          <bitfield caption="Receive FIFO 1 Full Interrupt Enable" mask="0x00000040" name="RF1FE"/>
          <bitfield caption="Receive FIFO 1 Message Lost Interrupt Enable" mask="0x00000080" name="RF1LE"/>
          <bitfield caption="High Priority Message Interrupt Enable" mask="0x00000100" name="HPME"/>
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000200" name="TCE"/>
          <bitfield caption="Transmission Cancellation Finished Interrupt Enable" mask="0x00000400" name="TCFE"/>
          <bitfield caption="Tx FIFO Empty Interrupt Enable" mask="0x00000800" name="TFEE"/>
          <bitfield caption="Tx Event FIFO New Entry Interrupt Enable" mask="0x00001000" name="TEFNE"/>
          <bitfield caption="Tx Event FIFO Watermark Reached Interrupt Enable" mask="0x00002000" name="TEFWE"/>
          <bitfield caption="Tx Event FIFO Full Interrupt Enable" mask="0x00004000" name="TEFFE"/>
          <bitfield caption="Tx Event FIFO Event Lost Interrupt Enable" mask="0x00008000" name="TEFLE"/>
          <bitfield caption="Timestamp Wraparound Interrupt Enable" mask="0x00010000" name="TSWE"/>
          <bitfield caption="Message RAM Access Failure Interrupt Enable" mask="0x00020000" name="MRAFE"/>
          <bitfield caption="Timeout Occurred Interrupt Enable" mask="0x00040000" name="TOOE"/>
          <bitfield caption="Message stored to Dedicated Receive Buffer Interrupt Enable" mask="0x00080000" name="DRXE"/>
          <bitfield caption="Bit Error Corrected Interrupt Enable" mask="0x00100000" name="BECE"/>
          <bitfield caption="Bit Error Uncorrected Interrupt Enable" mask="0x00200000" name="BEUE"/>
          <bitfield caption="Error Logging Overflow Interrupt Enable" mask="0x00400000" name="ELOE"/>
          <bitfield caption="Error Passive Interrupt Enable" mask="0x00800000" name="EPE"/>
          <bitfield caption="Warning Status Interrupt Enable" mask="0x01000000" name="EWE"/>
          <bitfield caption="Bus_Off Status Interrupt Enable" mask="0x02000000" name="BOE"/>
          <bitfield caption="Watchdog Interrupt Enable" mask="0x04000000" name="WDIE"/>
          <bitfield caption="Protocol Error in Arbitration Phase Enable" mask="0x08000000" name="PEAE"/>
          <bitfield caption="Protocol Error in Data Phase Enable" mask="0x10000000" name="PEDE"/>
          <bitfield caption="Access to Reserved Address Enable" mask="0x20000000" name="ARAE"/>
        </register>
        <register caption="Interrupt Line Select Register" name="MCAN_ILS" offset="0x58" rw="RW" size="4">
          <bitfield caption="Receive FIFO 0 New Message Interrupt Line" mask="0x00000001" name="RF0NL"/>
          <bitfield caption="Receive FIFO 0 Watermark Reached Interrupt Line" mask="0x00000002" name="RF0WL"/>
          <bitfield caption="Receive FIFO 0 Full Interrupt Line" mask="0x00000004" name="RF0FL"/>
          <bitfield caption="Receive FIFO 0 Message Lost Interrupt Line" mask="0x00000008" name="RF0LL"/>
          <bitfield caption="Receive FIFO 1 New Message Interrupt Line" mask="0x00000010" name="RF1NL"/>
          <bitfield caption="Receive FIFO 1 Watermark Reached Interrupt Line" mask="0x00000020" name="RF1WL"/>
          <bitfield caption="Receive FIFO 1 Full Interrupt Line" mask="0x00000040" name="RF1FL"/>
          <bitfield caption="Receive FIFO 1 Message Lost Interrupt Line" mask="0x00000080" name="RF1LL"/>
          <bitfield caption="High Priority Message Interrupt Line" mask="0x00000100" name="HPML"/>
          <bitfield caption="Transmission Completed Interrupt Line" mask="0x00000200" name="TCL"/>
          <bitfield caption="Transmission Cancellation Finished Interrupt Line" mask="0x00000400" name="TCFL"/>
          <bitfield caption="Tx FIFO Empty Interrupt Line" mask="0x00000800" name="TFEL"/>
          <bitfield caption="Tx Event FIFO New Entry Interrupt Line" mask="0x00001000" name="TEFNL"/>
          <bitfield caption="Tx Event FIFO Watermark Reached Interrupt Line" mask="0x00002000" name="TEFWL"/>
          <bitfield caption="Tx Event FIFO Full Interrupt Line" mask="0x00004000" name="TEFFL"/>
          <bitfield caption="Tx Event FIFO Event Lost Interrupt Line" mask="0x00008000" name="TEFLL"/>
          <bitfield caption="Timestamp Wraparound Interrupt Line" mask="0x00010000" name="TSWL"/>
          <bitfield caption="Message RAM Access Failure Interrupt Line" mask="0x00020000" name="MRAFL"/>
          <bitfield caption="Timeout Occurred Interrupt Line" mask="0x00040000" name="TOOL"/>
          <bitfield caption="Message stored to Dedicated Receive Buffer Interrupt Line" mask="0x00080000" name="DRXL"/>
          <bitfield caption="Bit Error Corrected Interrupt Line" mask="0x00100000" name="BECL"/>
          <bitfield caption="Bit Error Uncorrected Interrupt Line" mask="0x00200000" name="BEUL"/>
          <bitfield caption="Error Logging Overflow Interrupt Line" mask="0x00400000" name="ELOL"/>
          <bitfield caption="Error Passive Interrupt Line" mask="0x00800000" name="EPL"/>
          <bitfield caption="Warning Status Interrupt Line" mask="0x01000000" name="EWL"/>
          <bitfield caption="Bus_Off Status Interrupt Line" mask="0x02000000" name="BOL"/>
          <bitfield caption="Watchdog Interrupt Line" mask="0x04000000" name="WDIL"/>
          <bitfield caption="Protocol Error in Arbitration Phase Line" mask="0x08000000" name="PEAL"/>
          <bitfield caption="Protocol Error in Data Phase Line" mask="0x10000000" name="PEDL"/>
          <bitfield caption="Access to Reserved Address Line" mask="0x20000000" name="ARAL"/>
        </register>
