zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ1038CA70100.atdf
      <value-group caption="" name="PWMC_CMR2__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWMC_CMR3__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWMC_ETRG1__TRGMODE">
        <value caption="External trigger is not enabled." name="OFF" value="0x0"/>
        <value caption="External PWM Reset Mode" name="MODE1" value="0x1"/>
        <value caption="External PWM Start Mode" name="MODE2" value="0x2"/>
        <value caption="Cycle-by-cycle Duty Mode" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="" name="PWMC_ETRG1__TRGEDGE">
        <value caption="TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0" name="FALLING_ZERO" value="0"/>
        <value caption="TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1" name="RISING_ONE" value="1"/>
      </value-group>
      <value-group caption="" name="PWMC_ETRG2__TRGMODE">
        <value caption="External trigger is not enabled." name="OFF" value="0x0"/>
        <value caption="External PWM Reset Mode" name="MODE1" value="0x1"/>
        <value caption="External PWM Start Mode" name="MODE2" value="0x2"/>
        <value caption="Cycle-by-cycle Duty Mode" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="" name="PWMC_ETRG2__TRGEDGE">
        <value caption="TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0" name="FALLING_ZERO" value="0"/>
        <value caption="TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1" name="RISING_ONE" value="1"/>
      </value-group>
    </module>
    <module name="QSPI" caption="Quad Serial Peripheral Interface" id="11171" version="J">
      <register-group name="QSPI">
        <register caption="Control Register" name="QSPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="QSPI Enable" mask="0x00000001" name="QSPIEN"/>
          <bitfield caption="QSPI Disable" mask="0x00000002" name="QSPIDIS"/>
          <bitfield caption="QSPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Mode Register" name="QSPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Serial Memory Mode" mask="0x00000001" name="SMM" values="QSPI_MR__SMM"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000002" name="LLB" values="QSPI_MR__LLB"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000004" name="WDRBT" values="QSPI_MR__WDRBT"/>
          <bitfield caption="Chip Select Mode" mask="0x00000030" name="CSMODE" values="QSPI_MR__CSMODE"/>
          <bitfield caption="Number Of Bits Per Transfer" mask="0x00000F00" name="NBBITS" values="QSPI_MR__NBBITS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0x00FF0000" name="DLYBCT"/>
          <bitfield caption="Minimum Inactive QCS Delay" mask="0xFF000000" name="DLYCS"/>
        </register>
        <register caption="Receive Data Register" name="QSPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
        </register>
        <register caption="Transmit Data Register" name="QSPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
        </register>
        <register caption="Status Register" name="QSPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading SPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing SPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing SPI_TDR)" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise (cleared on read)" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Status (cleared on read)" mask="0x00000400" name="INSTRE"/>
          <bitfield caption="QSPI Enable Status" mask="0x01000000" name="QSPIENS"/>
        </register>
        <register caption="Interrupt Enable Register" name="QSPI_IER" offset="0x14" rw="W" size="4" atomic-op="set:QSPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise Interrupt Enable" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status Interrupt Enable" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Interrupt Enable" mask="0x00000400" name="INSTRE"/>
        </register>
        <register caption="Interrupt Disable Register" name="QSPI_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:QSPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise Interrupt Disable" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status Interrupt Disable" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Interrupt Disable" mask="0x00000400" name="INSTRE"/>
        </register>
